class MOCKDATA {
  static const HEALEAT_DATA = {
    "code": 1,
    "msg": "成功",
    "data": {
      "search_default": "吃什么 来这里搜索",
      "title": "适合吃什么",
      "desc": "综合1000万用户数据研究得出",
      "items": [
        {
          "id": "31",
          "icon":
              "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739390086272.jpg",
          "title": "慢性病研究院",
          "desc": "饮食调理，吃出营养与健康",
          "color": "#5A92F5",
          "items": [
            {
              "class": ["必知痛风小常识", "食材嘌呤一目了然", "得了痛风吃什么"],
              "color": "#35CDF3",
              "id": "16",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739530096668.jpg",
              "title": "痛风"
            },
            {
              "class": ["基础知识早知道", "什么食材不能吃", "这样吃控制血糖"],
              "color": "#78B4FD",
              "id": "34",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739538499629.jpg",
              "title": "糖尿病"
            },
            {
              "class": ["正确认识心脏病", "吃什么对心脏最好", "健康菜谱保护心脏"],
              "color": "#91E2C1",
              "id": "35",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739559163033.jpg",
              "title": "心脏病"
            }
          ]
        },
        {
          "id": "4",
          "icon":
              "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739353506982.jpg",
          "title": "母婴研究院",
          "desc": "关爱妈妈健康，呵护宝宝成长",
          "color": "#5FA768",
          "items": [
            {
              "class": ["辅食何时添加有讲究", "做辅食用哪些食材比较好", "不同月份辅食怎么做"],
              "color": "#FFCC44",
              "id": "5",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739430263805.jpg",
              "title": "宝宝辅食"
            },
            {
              "class": ["备孕饮食有讲究", "吃哪些食材可助孕", "备孕期菜谱这样做"],
              "color": "#7DCDA6",
              "id": "53",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_157734915665685.jpg",
              "title": "备孕期"
            },
            {
              "class": ["孕早期知识大全", "孕早期能吃哪些食材", "怀孕初期食谱做法"],
              "color": "#FEAE9A",
              "id": "54",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_157836373989451.jpg",
              "title": "孕早期"
            },
            {
              "class": ["孕中期必知小常识", "怀孕中期不能吃什么", "孕中期营养食谱做法"],
              "color": "#9EDC92",
              "id": "55",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_157948495252453.jpg",
              "title": "孕中期"
            },
            {
              "class": ["孕后期小知识合集", "怀孕后期饮食禁忌", "你最需要的营养食谱"],
              "color": "#9EC5E1",
              "id": "56",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_157948522885126.jpg",
              "title": "孕后期"
            },
            {
              "class": ["坐月子必知小常识", "月子吃什么能催奶", "营养月子餐做法大全"],
              "color": "#FFB995",
              "id": "58",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_158218249216263.jpg",
              "title": "坐月子"
            },
            {
              "class": ["母乳喂养必备小知识", "哺乳期这些不要吃", "营养食谱促进泌乳"],
              "color": "#9DCFF4",
              "id": "59",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_158374222241689.jpg",
              "title": "哺乳期"
            }
          ]
        },
        {
          "id": "1",
          "icon":
              "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156739352424524.jpg",
          "title": "小儿研究院",
          "desc": "小儿护理饮食指南，新手爸妈必备",
          "color": "#FF7267",
          "items": [
            {
              "class": ["发热知识帮你缓解焦", "宝宝发烧能吃什么", "营养食谱巧搭配"],
              "color": "#FF9292",
              "id": "50",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_156756434402619.jpg",
              "title": "小儿发热"
            },
            {
              "class": ["这些常识要了解", "咳嗽忌吃的食材", "这些食谱止咳最有效"],
              "color": "#FCC782",
              "id": "51",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_157311606272476.jpg",
              "title": "小儿咳嗽"
            },
            {
              "class": ["家长必知腹泻知识", "哪些食材不能吃", "营养食谱推荐"],
              "color": "#B5B1FF",
              "id": "52",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_157362919749242.jpg",
              "title": "小儿腹泻"
            }
          ]
        },
        {
          "id": "27",
          "icon":
              "https://st-cn.meishij.net/r/231/202/7675731/s7675731_158572966255231.jpg",
          "title": "身体调理研究院",
          "desc": "合理膳食，养出好身体",
          "color": "#FF7267",
          "items": [
            {
              "class": ["贫血小常识知多少", "吃什么补血最快", "补血食谱做法大全"],
              "color": "#e87353",
              "id": "8",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_158573035213820.jpg",
              "title": "贫血"
            },
            {
              "class": ["健康减肥小常识", "这些食物越吃越瘦", "科学饮食吃出好身材"],
              "color": "#29c0eb",
              "id": "60",
              "img":
                  "https://st-cn.meishij.net/r/231/202/7675731/s7675731_158572975074326.jpg",
              "title": "瘦身"
            }
          ]
        }
      ]
    }
  };
}
